[
  {
    "name": "Full Stack Developer ",
    "companyName": "Aveenir IT",
    "Website": " www.aveenirit.com",
    "time": "03/2020 – 04/2023",
    "responsibility1": "Identified and resolved over 200 bugs within a six-month period, resulting in a remarkable 15% improvement in application efficiency and performance.",
    "responsibility2": "Demonstrated a strong ability to meet project requirements by developing and integrating more than 20 new features.",
    "responsibility3": "Leveraged in-depth knowledge of MERN stack technologies to architect and implement robust and scalable solutions.",
    "responsibility4": "Actively participated in agile methodologies for project management.",
    "technologies": "Javascript, React Js,TypeScript, Redux, Mongoose, Prisma"
  },
  {
    "name": "Jr. Software Engineer",
    "time": "07/2018 – 07/2019",
    "companyName": "Srejanee CybernetiX",
    "responsibility1": "Identified and resolved software bugs and issues within a complex payroll system, contributing to the overall stability and reliability of the application.",
    "responsibility2": "Designed and implemented more than 10 new features in the payroll system, enhancing its functionality and quality, and ensuring it met the evolving needs of the organization.",
    "responsibility3": "Fostered teamwork, collaboration, and continuous improvement in cross-functional teams to advance software development efforts.",
    "technologies": "ReactJs, Material-UI, Node.Js, Express.Js, Mongoose, Firebase, Jira, Github, VS Code"
  },
  {
    "name": "Teaching Assistant",
    "companyName": "Dept. of Computer Science, American International University-Bangladesh",
    "time": "02/2018 -  04/2018",
    "responsibility1": "Collaborating with the instructor to enhance the learning experience",
    "responsibility2": "Assisting students in understanding and applying ASP.NET concepts and principles.",
    "responsibility3": "Conducting tutorial sessions and facilitating discussions",
    "responsibility4": "Assisting in the development and implementation of course materials",
    "technologies": "C#, ASP.Net"
  }
]